# PathReinforcementType Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
PathReinforcement..::..PathReinforcementType Property
PathReinforcement Class See Also
---
Retrieves the type of the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public PathReinforcementType PathReinforcementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathReinforcementType As PathReinforcementType
	Get
```

Visual C++
---
```text
public:
property PathReinforcementType^ PathReinforcementType {
	PathReinforcementType^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace